notifi-it/WFH/firmware/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-1.8 — ESP32-S3R8, 16MB flash, 8MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# QEMU has no PSRAM model — boot anyway instead of aborting (real board unaffected).
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# LittleFS mount recurses through lfs_dir_fetchmatch and needs far more than
# the 3584-byte default. Overflowing it corrupts whatever sits after the
# stack, which surfaces as an unrelated assert inside the flash mutex.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# The storage spike writes thousands of rows in one go; keep the watchdog
# from calling a long synchronous=FULL run a hang.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_LV_USE_PERF_MONITOR=y
